## Задание

Миша заполнял таблицу истинности функции (x ∨ ¬y) ⋀ ¬(y ≡ z) ⋀ w, но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав,
какому столбцу таблицы соответствует каждая из переменных.

Определите, какому столбцу таблицы соответствует каждая из переменных у, г. В ответе напишите буквы ш, т, у, z в том порядке, в котором идут
соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе
пишите подряд, никаких разделителей между буквами ставить не нужно.

### Таблица

|     |     |     |     |  F  |
|:---:|:---:|:---:|:---:|:---:|
|  0  |  1  |     |  0  |  1  |
|     |  1  |  1  |  0  |  1  |
|  1  |     |  0  |     |  1  |

```python
from itertools import product, permutations # Импорт библиотек/методов

def F(w,x,y,z): # Задаём функцию
    return (x or (not y)) and (not (y==z)) and w # Пишем условное выражение, которое дано в самом начале

for a1,a2,a3,a4 in product([0,1], repeat=4): #Используем метод product для пустых клеток таблицы
    table = ((0,1,a1,0), 
             (a2,1,1,0),
             (1,a3,0,a4))
    
    if len(table) == len(set(table)): # Проверяем не совпадают ли строки таблицы
        for p in permutations("wxyz"): # Перебираем возможные места переменных x,y,z,w
            if [F(**dict(zip(p, row))) for row in table] == [1,1,1]: # Сравниваем, подходит ли массив строк таблицы после обработки с необходимыми значениями функции
                print(p) # Выводим
```

**Ответ: xwzy**